app/controllers/quotes_controller.rb

  def index
    @quote = Quote.order("RANDOM()").first
---
SELECT  "quotes".* FROM "quotes" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]